# -*- coding: utf-8; -*-
#+SETUPFILE: "../include/css-1.org"
#+TITLE: Scrapy-ing the NIST X-ray Attenuation Databases
#+DATE: [2017-05-31 Wed]
#+PROPERTY: header-args:ipython :session :eval no-export :exports both

I am currently preparing with two other colleagues a review paper on
X-ray tomography of cementitious materials, for which I need to
retrieve tabulated values of the [[https://en.wikipedia.org/wiki/Mass_attenuation_coefficient#Mass_attenuation_coefficients_for_X-rays][X-ray mass attenuation coefficients]]
of all elements.

NIST provides such data (see [[https://www.nist.gov/pml/x-ray-mass-attenuation-coefficients][X-Ray Mass Attenuation Coefficients]] by
J. H. Hubbell and S. M. Seltzer). However, it does not come in the
form of simple files that can be downloaded. Rather, the values are
presented in nicely formatted HTML tables (see [[http://physics.nist.gov/PhysRefData/XrayMassCoef/ElemTab/z01.html][here]] for an example).

In this post, I set out to extract this data as a HDF5 table. Of
course, this looks like a job for [[https://scrapy.org/][Scrapy]]!

* Putting it all together in a HDF5 file

We are now ready to run our two spiders

#+BEGIN_EXAMPLE
scrapy crawl table1 -o table1.json
scrapy crawl table3 -o table3.json
#+END_EXAMPLE

You can download the json files here: [[file:./20170531-Scrapy-ing_the_NIST_X-ray_Attenuation_Databases/table1.json][Table 1]] and [[file:./20170531-Scrapy-ing_the_NIST_X-ray_Attenuation_Databases/table3.json][Table 3]]. We use the
=json= module in the standard library to read this files, and merge
the =dict= of =dicts= that corresponds to Table 3 into one single
=dict=.

#+BEGIN_SRC ipython :results output :var ROOT=(file-name-sans-extension buffer-file-name)
  import json
  import os.path

  with open(os.path.join('.', ROOT, 'table1.json'), 'r') as f:
      table1 = json.load(f)[0]
  with open(os.path.join('.', ROOT, 'table3.json'), 'r') as f:
      table3 = dict(next(iter(i.items())) for i in json.load(f))

  print(table1['1'])
  print(table3['1'][0:5])
#+END_SRC

#+RESULTS:
: {'symbol': 'H', 'name': 'Hydrogen', 'Z/A': '0.99212', 'density [g/cm^3]': '8.375E-05'}
: [['1.00000E-03', '7.217E+00', '6.820E+00'], ['1.50000E-03', '2.148E+00', '1.752E+00'], ['2.00000E-03', '1.059E+00', '6.643E-01'], ['3.00000E-03', '5.612E-01', '1.693E-01'], ['4.00000E-03', '4.546E-01', '6.549E-02']]

We are now ready to create our HDF5 file. Its structure is very
simple: we create one dataset per element. The dataset's label is the
element's symbol. The table attached to the dataset is the linear
absorption coefficient. A few attributes are further attached to the
dataset

  - =name=: the element's name,
  - =Z=: the element's atomic number (byte),
  - =Z/A=, =density [g/cm^3]=: double precision floats.

#+BEGIN_SRC ipython :results silent
  import h5py
  import numpy as np

  name = 'X-ray_mass_absorption_coefficients.hdf5'

  with h5py.File(os.path.join('.', ROOT, name), 'w') as f:
      for z, attrs in table1.items():
          mu = [[np.float64(x) for x in row] for row in table3[z]]
          dset = f.create_dataset(attrs['symbol'],
                                  data=np.asarray(mu))
          dset.attrs['name'] = attrs['name']
          dset.attrs['Z'] = np.int8(z)
          for key in ['Z/A', 'density [g/cm^3]']:
              dset.attrs[key] = np.float64(attrs[key])
#+END_SRC

